Правила записи римскими цифрами:

    Цифры от 1 до 3 пишутся путем повторения I: I-1, II-2, III-3.
    Если меньшая цифра стоит перед большей — она вычитается из большей.
        Например, IV (5-1=4).
    Если большая цифра стоит перед меньшей — они складываются.
        Например, VI (5+1=6) или LXV (50+10+5=65).
    Цифры V, L, D не повторяются; цифры I, X, C, M могут повторяться
        не больше трех раз.
    Чтобы не было повторения цифры больше трех раз применяется следующий
        порядок написания: IX (10-1=9), XC (100-10=90), CM (1000-100=900),
        IV (5-1=4), XL (50-10=40), CD (500-100=400).
    Если над цифрой стоит горизонтальная черта, она увеличивается в 1000 раз.
    Если над цифрой стоят две горизонтальные черты, она становится миллионом.
        Два последних правила могут не действовать в русском рукописном тексте,
        т. к. у нас было принято выделять римские цифры подчеркиванием сверху
        или снизу.

Исключения из правил:

    99 исторически пишется как XCIX (XC+IX, т. е. 90+9), а не IС (100-1).
    Иногда, если меньшая цифра стоит перед большей, это означает не вычитание,
        а умножение. В таких случаях, как правило, большая цифра написана чуть ниже.
        VIM — это 6×1000 = 6000.
    Умножение может обозначаться «.». Например VI.C — это 6х100 = 600.
    В некоторых печатных книгах на конце числа можно встретить вместо i или I
        соответственно j или J. Например xviii и xviij — оба = 18.
    В редких случаях I на конце числа обозначает не 1, а 2.
    В старых текстах большие числа иногда обозначались с использованием знака «)»
        и читались следующим образом: CI) как M, I) как D. В этом же правиле,
        если к таким цифрам дополнялся знак «( )», они умножались на 10.
        Например: I)= 500, (I)) = 5 000, а ((I))) = 50 000.

На что следует обратить внимание:

    Запрет на повторение одной и той же цифры более трех раз появился в XIX веке,
        поэтому в некоторых более ранних текстах можно увидеть XXXX вместо XL,
        IIIII вместо V и т. д.,
    Цифра «0» появилась только в Средние века, обозначалась буквой N
        (от лат. nulla — ноль),
    Для следующих цифр раньше использовались специальные знаки:
        1000 — ↀ (или C|Ɔ), 5000 – ↁ(или |Ɔ),10000 – ↂ (или CC|ƆƆ),
    Современные западные размеры одежды S, M, L, XL и т. д. никакого отношения
        к римским цифрам не имеют. Это аббревиатуры английских слов Small
        (маленький), Medium (средний), Large (большой), eXtraLarge (очень большой).

